Revit 2017 API
MechanicalSystem.StaticPressure Property
 The static pressure of this piping system
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017. Please use GetStaticPressure method instead.")]
public double StaticPressure { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017. Please use GetStaticPressure method instead.")> _
Public ReadOnly Property StaticPressure As Double
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017. Please use GetStaticPressure method instead.")]
public:
property double StaticPressure {
	double get ();
}
See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace